arribada/linkit-v4-core/ports/nrf52840/main.cpp
/**
 * @file main.cpp
 * @brief Application entry point — 8-phase init, FSM start, infinite scheduler loop.
 *
 * Init phases: peripherals → power-on check → storage → battery → core services
 * → communication (SWS + satellite/LoRa + GPS) → sensors → runtime services.
 */

// --- Nordic SDK ---
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_log_redirect.h"
#include "nrfx_spim.h"

// --- BSP & GPIO ---
#include "bsp.hpp"
#include "gpio.hpp"
#include "gpio_buzzer.hpp"

// --- Core system (FSM, scheduler, config, debug, RTC, timer) ---
#include "gentracker.hpp"
#include "config_store_fs.hpp"
#include "debug.hpp"
#include "console_log.hpp"
#include "nrf_rtc.hpp"
#include "nrf_timer.hpp"
#include "nrf_switch.hpp"
#include "reed.hpp"
#include "nrf_rgb_led.hpp"
#include "nrf_i2c.hpp"
#include "nrf_usb.hpp"
#include "nrf_memory_access.hpp"
#include "is25_flash.hpp"
#include "fs_log.hpp"
#include "sys_log.hpp"
#include "dte_handler.hpp"
#include "ble_interface.hpp"
#include "ota_flash_file_updater.hpp"
#ifdef DEBUG_UART_TX_PIN
#include "nrf_debug_uart.hpp"
#endif

// --- Battery monitor ---
#if defined(BATTERY_MONITOR_ANALOG)
#include "nrf_battery_mon.hpp"
#elif defined(BATTERY_MONITOR_FAKE)
#include "fake_battery_mon.hpp"
#elif defined(BATTERY_MONITOR_STC3117)
#include "stc3117_gasgauge.hpp"
#endif

// --- Communication backends (mutually exclusive) ---
#include "m10qasync.hpp"
#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
#include "lora_rak3172.hpp"
#elif defined(ARGOS_SMD) && (ARGOS_SMD == 1)
#include "smd_sat.hpp"
#if defined(SMD_UART) && (SMD_UART == 1)
#include "smd_sat_cmd_at.hpp"
#else
#include "smd_sat_cmd_spi.hpp"
#endif
#else
#include "kim2.hpp"
#endif

// --- Sensor drivers ---
#if ENABLE_ALS_SENSOR
#include "ltr_303.hpp"
#endif
#if ENABLE_PH_SENSOR
#include "oem_ph.hpp"
#endif
#if ENABLE_SEA_TEMP_SENSOR
#include "oem_rtd.hpp"
#include "ezo_rtd.hpp"
#include "TSYS01.hpp"
#endif
#if ENABLE_CDT_SENSOR || ENABLE_PRESSURE_SENSOR
#include "ms58xx.hpp"
#include "bar100.hpp"
#include "lps28dfw.hpp"
#endif
#if ENABLE_CDT_SENSOR
#include "cdt.hpp"
#include "ad5933.hpp"
#endif
#if ENABLE_AXL_SENSOR
#include "bma400.hpp"
#endif
#if ENABLE_THERMISTOR_SENSOR
#include "thermistor.hpp"
#endif
#ifdef CAM_PWR_EN
#include "runcam.hpp"
#endif

// --- Services ---
#include "gps_service.hpp"
#include "argos_tx_service.hpp"
#include "argos_rx_service.hpp"
#include "memory_monitor_service.hpp"
#include "dive_mode_service.hpp"
#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
#include "lora_tx_service.hpp"
#endif
#if ENABLE_SWS_ANALOG
#include "sws_analog_service.hpp"
#endif
#if ENABLE_PRESSURE_SENSOR
#include "pressure_sensor_service.hpp"
#endif
#if ENABLE_ALS_SENSOR
#include "als_sensor_service.hpp"
#endif
#if ENABLE_PH_SENSOR
#include "ph_sensor_service.hpp"
#endif
#if ENABLE_SEA_TEMP_SENSOR
#include "sea_temp_sensor_service.hpp"
#endif
#if ENABLE_CDT_SENSOR
#include "cdt_sensor_service.hpp"
#endif
#if ENABLE_AXL_SENSOR
#include "axl_sensor_service.hpp"
#endif
#if ENABLE_THERMISTOR_SENSOR
#include "thermistor_sensor_service.hpp"
#endif
#include "cam_service.hpp"
#if ENABLE_MORTALITY_SENSOR
#include "mortality_service.hpp"
#endif

// --- Utilities ---
#include <algorithm>
#include <cstddef>
#include <cstring>
#include "heap.h"
#include "etl/error_handler.h"

/// @name Global peripheral pointers
/// @brief Assigned during init phases, valid for the entire application lifetime.
///        All point to static objects allocated in .bss (not heap).
/// @{
FileSystem *main_filesystem;              ///< LittleFS filesystem on IS25 external flash
ConfigurationStore *configuration_store;  ///< Parameter persistence (206 params via LFS)
BLEService *ble_service;                  ///< BLE NUS interface for DTE and debug
OTAFileUpdater *ota_updater;              ///< Firmware OTA via BLE or flash file
MemoryAccess *memory_access;              ///< RAM read/write access for DTE DUMPD command
Timer *system_timer;                      ///< Hardware timer (NrfTimer, 1 ms resolution)
Scheduler *system_scheduler;              ///< Task scheduler wrapping system_timer
RGBLed *status_led;                       ///< On-board RGB status LED
ReedSwitch *reed_switch;                  ///< Reed switch with confirmation gesture logic
DTEHandler *dte_handler;                  ///< DTE protocol command dispatcher (PARMR/PARMW/STAT/DUMPD)
RTC *rtc;                                 ///< Real-time clock (NrfRTC, epoch seconds)
BatteryMonitor *battery_monitor;          ///< Battery voltage/level monitor (variant-dependent)
GPSDevice *gps_device;                    ///< GNSS receiver (u-blox M10Q)
GPSService *gps_service = nullptr;        ///< GNSS service singleton (set by phase 6 if M10Q detected)
KineisDevice *kineis_device_instance = nullptr;  ///< Satellite TX device (SMD, KIM2, or LoRa)
#if defined(ARGOS_SMD) && (ARGOS_SMD == 1)
SmdSat *smd_sat_instance = nullptr;       ///< SMD satellite instance (needed for DFU OTA)
#endif
#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
LoRaDevice *lora_device_instance = nullptr;  ///< LoRa RAK3172 instance (needed for LORATX DTE)
#endif
#if !(defined(LORA_RAK3172) && (LORA_RAK3172 == 1)) && !(defined(ARGOS_SMD) && (ARGOS_SMD == 1))
KIM2Device *kim2_device_instance = nullptr;  ///< KIM2 instance (needed for KIMBR DTE bridge)
#endif
#if ENABLE_MORTALITY_SENSOR
MortalityService *mortality_service = nullptr;  ///< Bird mortality detection service (RSPB only)
#endif
Buzzer *buzzer_ctl;                       ///< Optional piezo buzzer (board-dependent)
/// @}

/// @brief Active debug output channel (UART, USB CDC, BLE NUS, or NONE).
///        Defaults to UART on RSPB, USB CDC on LinkIt V4 — but ONLY in debug
///        builds. Release builds (`NDEBUG` defined by `CMAKE_BUILD_TYPE=Release`)
///        default to NONE so the device stays silent in the field — no USB/UART
///        traffic underwater or in storage mode, no current drawn by the debug
///        peripheral, and no risk of a host enumerating the CDC port when the
///        epoxied tag is plugged into anything.
///        Can still be overridden at runtime via DTE if needed for debugging.
#ifdef NDEBUG
BaseDebugMode g_debug_mode = BaseDebugMode::NONE;
#elif defined(BOARD_RSPB)
BaseDebugMode g_debug_mode = BaseDebugMode::UART;
#else
BaseDebugMode g_debug_mode = BaseDebugMode::USB_CDC;
#endif

/// @brief Guards _write() from outputting before debug peripheral is ready.
static bool m_is_debug_init = false;

