arribada/linkit-v4-core/ports/nrf52840/main.cpp
FSM_INITIAL_STATE(GenTracker, BootState)

/// @brief Number of IS25 flash blocks reserved for OTA firmware images (last 1 MB).
#define OTA_UPDATE_RESERVED_BLOCKS ((1024 * 1024) / IS25_BLOCK_SIZE)

/// @brief Reed switch debounce time in ms.
/// @note Increased from 25 ms to 250 ms to filter noise from VSENSORS rail switching.
#define REED_SWITCH_DEBOUNCE_TIME_MS    250


/**
 * @brief Infinite fault indicator — blinks the RGB LED and kicks the watchdog forever.
 *
 * Uses NrfRGBLed::set_color_raw() for bare-metal GPIO access (no timer/scheduler dependency).
 *
 * Fault color map:
 *   - RED 50 ms      → HardFault
 *   - YELLOW 50 ms   → MemManagement
 *   - MAGENTA 50 ms  → Stack overflow (__stack_chk_fail)
 *   - CYAN 50 ms     → Malloc failure
 *   - RED 200 ms     → ETL assertion
 *
 * @param color    LED color identifying the fault type.
 * @param delay_ms Blink half-period in milliseconds (default 50 ms).
 */
[[noreturn]] static void fault_blink_loop(RGBLedColor color, unsigned int delay_ms = 50) {
	for (;;) {
#ifdef GPIO_LED_REG
		GPIOPins::set(GPIO_LED_REG);
#endif
		NrfRGBLed::set_color_raw(BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, color);
		nrf_delay_ms(delay_ms);
		NrfRGBLed::set_color_raw(BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::BLACK);
		nrf_delay_ms(delay_ms);
		PMU::kick_watchdog();
	}
}

// Bounded fault-reset recovery (2026-07 audit). On RSPB a soft reset does NOT
// cut power, so a DETERMINISTIC CPU fault — e.g. one hit every boot during init,
// BEFORE the FSM boot-fail counter (BootState) ever runs — would reset-loop
// forever at active current and drain a sealed tag (a C++ try/catch cannot catch
// a HardFault, so the init-phase barrier does not cover this). Count consecutive
// fault resets in .noinit — wiped by a TPL5111 power cut, so it only accumulates
// within ONE power-on session — and after N escalate: on EXTERNAL_WAKEUP pulse
// MCU_DONE directly (NO flash writes, we're in a fault context) so the TPL5111
// cuts power and retries at the next periodic wake (~0.1 uA) with a clean boot.
#ifndef CPPUTEST
static __attribute__((section(".noinit"))) volatile uint32_t s_fault_magic;
static __attribute__((section(".noinit"))) volatile uint32_t s_fault_count;
#else
static uint32_t s_fault_magic, s_fault_count;
#endif
static constexpr uint32_t FAULT_MAGIC = 0xFA017C0DUL;
static constexpr uint32_t FAULT_RESET_MAX = 5;

[[noreturn]] static void fault_terminal(PMULogType type) {
	if (s_fault_magic != FAULT_MAGIC) { s_fault_magic = FAULT_MAGIC; s_fault_count = 0; }
	s_fault_count = s_fault_count + 1;   // not ++ : volatile ++ is deprecated (-Werror=volatile)
	PMU::save_stack(type);
	if (s_fault_count >= FAULT_RESET_MAX) {
#if defined(EXTERNAL_WAKEUP) && defined(MCU_DONE_PIN)
		// Terminal: hand off to the TPL5111 without touching flash. Raw nrf_gpio
		// so it works even if GPIOPins::initialise() had not run when the fault hit.
		auto& done = BSP::GPIO_Inits[MCU_DONE_PIN];
		nrf_gpio_cfg_output(done.pin_number);
		nrf_gpio_pin_set(done.pin_number);
		PMU::delay_ms(100);
		nrf_gpio_pin_clear(done.pin_number);
		PMU::delay_ms(2000);   // wait for the TPL5111 to cut power
#endif
		// Power not cut (or non-EXTERNAL_WAKEUP board) — fall through to reset.
	}
	for (;;) { PMU::reset(false); }
}

extern "C" void HardFault_Handler() {
#ifdef NDEBUG
	fault_terminal(PMULogType::HARDFAULT);
#else
	fault_blink_loop(RGBLedColor::RED);
#endif
}

extern "C" void MemoryManagement_Handler(void) {
#ifdef NDEBUG
	fault_terminal(PMULogType::MMAN);
#else
	fault_blink_loop(RGBLedColor::YELLOW);
#endif
}

extern "C" {
	/// @brief Stack canary value for -fstack-protector.  Fixed constant — see review note.
	void *__stack_check_guard = (void*)0xDEADBEEF;
	/// @brief Called by -fstack-protector when the canary is corrupted.
	void __wrap___stack_chk_fail(void) {
#ifdef NDEBUG
		fault_terminal(PMULogType::STACK);
#else
		fault_blink_loop(RGBLedColor::MAGENTA);
#endif
	}
}

extern "C" void vApplicationMallocFailedHook() {
#ifdef NDEBUG
	fault_terminal(PMULogType::MALLOC);
#else
	fault_blink_loop(RGBLedColor::CYAN);
#endif
}

/** @brief ETL library error callback — logs the exception then resets or blinks.
 *  @param e  ETL exception with file/line info.
 */
void etl_error_handler(const etl::exception& e)
{
	DEBUG_TRACE("ETL error: %s in %s : %u", e.what(), e.file_name(), e.line_number());
#ifdef NDEBUG
	fault_terminal(PMULogType::ETL);
#else
	fault_blink_loop(RGBLedColor::RED, 200);
#endif
}

/**
 * @brief Low-level write override — routes stdout/printf to the active debug channel.
 *
 * Overrides the weak newlib _write() so that printf / std::cout output is directed
 * to UART, USB CDC, or BLE NUS depending on g_debug_mode.
 *
 * @param file  File descriptor (unused — all output goes to debug channel).
 * @param ptr   Data buffer to write.
 * @param len   Number of bytes to write.
 * @return Always returns @p len (bytes accepted, even if output is suppressed).
 * @note Safe to call from ISR context only for UART and USB CDC paths.
 *       BLE NUS path checks __get_IPSR() and skips if in interrupt context.
 */
extern "C" int _write(int file, char *ptr, int len)
{
#ifdef DEBUG_UART_TX_PIN
	if (g_debug_mode == BaseDebugMode::UART && NrfDebugUart::is_init())
		NrfDebugUart::write(ptr, len);
	else
#endif
	if (g_debug_mode == BaseDebugMode::USB_CDC && m_is_debug_init)
		NrfUSB::write(ptr, len);
	else if (ble_service && !__get_IPSR() && g_debug_mode == BaseDebugMode::BLE_NUS) {
		ble_service->write_best_effort(std::string(ptr, len));
	}
	return len;
}


// ═══════════════════════════════════════════════════════════════
// Init sub-functions
//
// Each phase creates static objects (in .bss/.data) and assigns
// global pointers.  This keeps main() readable and reduces its
// stack frame — static objects are visible in the linker map.
// ═══════════════════════════════════════════════════════════════

/** @brief References returned by init_peripherals() for use in subsequent init phases. */
struct InitContext {
	NrfSwitch& reed;   ///< Reed switch — needed by power-on check, gesture, and dive mode
	Is25Flash& flash;   ///< External NOR flash — needed by LFS and OTA updater
};

/**
 * @brief Phase 1 — Initialise core peripherals.
 *
 * Sets up: PMU, watchdog, GPIO, RTC, hardware timer, debug output (UART/USB/BLE),
 * NFC pin check, RGB LED, external LED, reed switch, buzzer, BLE stack, IS25 flash.
 *
 * @return InitContext with references to reed switch and flash for subsequent phases.
 */
static InitContext init_peripherals()
{
	// Storage-mode wake filter: if we just woke from PSEUDO_POWER_OFF without
	// a magnet held, the device enters System OFF mode immediately (deepest
	// sleep ~0.4 µA + Hall switch ~1.7 µA = ~2 µA total). Must run BEFORE
	// PMU::initialise() (which clears RESETREAS / GPREGRET) and BEFORE
	// start_watchdog() (WDT would tick in System OFF and reset the chip).
	// No-op on boards without PSEUDO_POWER_OFF (RSPB).
	PMU::storage_off_check();

	PMU::initialise();
#ifndef DEBUG_NO_WATCHDOG
	PMU::start_watchdog();
	PMU::kick_watchdog();
#endif
	GPIOPins::initialise();
	etl::error_handler::set_callback<etl_error_handler>();

