arribada/linkit-v4-core/ports/nrf52840/main.cpp
#if defined(ARGOS_SMD) && (ARGOS_SMD == 1)
	// Encapsulated-device safety: a soft reset (OTA, watchdog, nrfjprog --reset,
	// PMU::reset) leaves the STM32WL co-processor running with state on its VDD
	// caps — its SPI sequence number doesn't match what the freshly-booted nRF
	// expects, producing INVALID_CMD / "Response incomplete" cascades on the
	// first session. POR + cap discharge here forces a clean STM32WL boot.
	// Skipped on POWER_ON resets where the STM was off anyway.
	//
	// Use drive_low() (= cfg_output then clear) for SAT_RESET — the BSP entry
	// is DIR_INPUT (commented "for probe flashing"), so init_pin+clear would
	// NOT actively drive the line. drive_low overrides to OUTPUT and forces
	// the pin LOW, holding the STM32WL in reset while VDD discharges.
	if (PMU::reset_cause() != ResetCause::POWER_ON) {
		GPIOPins::clear(SAT_PWR_EN);     // Cut STM32WL VDD (BSP=OUTPUT)
#ifdef SAT_RESET
		GPIOPins::drive_low(SAT_RESET);  // Force STM32WL into reset (overrides BSP=INPUT)
#endif
#ifdef SMD_VPA_PIN
		GPIOPins::drive_low(SMD_VPA_PIN);
#endif
		PMU::delay_ms(500);               // Drain VDD caps — STM32WL needs ~50-200ms typically; 500ms is safe margin
#ifdef SAT_RESET
		GPIOPins::release_to_highz(SAT_RESET);  // Restore high-Z so SmdSat::power_on can manage normally
#endif
	}
#endif

	rtc = &NrfRTC::get_instance();
	NrfRTC::get_instance().init();

	DEBUG_TRACE("Timer...");
	system_timer = &NrfTimer::get_instance();
	NrfTimer::get_instance().init();

	// Init debug output (UART, USB CDC, BLE, or NONE).
	//
	// In release builds (NDEBUG), `g_debug_mode` defaults to NONE so no logs
	// flow over UART/USB during operational/underwater states — see the
	// declaration of `g_debug_mode` for rationale.
	//
	// USB CDC peripheral, however, is ALWAYS initialised on LinkIt regardless
	// of `g_debug_mode` because `USB_DTE_ENABLED` makes ConfigurationState
	// rely on USB for DTE access (magnet-gesture bench configuration). The
	// `_write()` routing checks `g_debug_mode` so no log bytes are pushed to
	// USB when in NONE mode — the peripheral is just enumerable for DTE.
	m_is_debug_init = true;
	static ConsoleLog console_log;
	DebugLogger::console_log = (g_debug_mode == BaseDebugMode::NONE) ? nullptr : &console_log;
#ifdef DEBUG_UART_TX_PIN
	// RSPB: UART is the primary debug channel. Only init when actively
	// requested (so release-mode NONE leaves UART pins inactive → no power).
	if (g_debug_mode == BaseDebugMode::UART) {
		NrfDebugUart::init(DEBUG_UART_TX_PIN);
	} else if (g_debug_mode != BaseDebugMode::NONE) {
		// Edge case: RSPB explicitly configured for USB CDC or BLE NUS debug.
		NrfUSB::init();
	}
#else
	// LinkIt: USB is shared between debug output and DTE — always init,
	// even when g_debug_mode == NONE, so ConfigurationState (magnet-gesture
	// DTE access) keeps working in release builds.
	NrfUSB::init();
#endif
	setvbuf(stdout, NULL, _IONBF, 0);
	nrf_log_redirect_init();

	// Verify NFC pins are configured as GPIO (P0.09/P0.10 used for SPI CS and SWS_OUT)
	{
		uint32_t nfcpins = NRF_UICR->NFCPINS;
		if ((nfcpins & UICR_NFCPINS_PROTECT_Msk) == (UICR_NFCPINS_PROTECT_NFC << UICR_NFCPINS_PROTECT_Pos)) {
			DEBUG_ERROR("UICR: NFC pins still in NFC mode (0x%08X) — P0.09/P0.10 unusable as GPIO!", nfcpins);
		} else {
			DEBUG_INFO("UICR: NFC pins configured as GPIO (0x%08X)", nfcpins);
		}
	}

	DEBUG_TRACE("RGB LED...");
	static NrfRGBLed nrf_status_led("STATUS", BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::WHITE);
	status_led = &nrf_status_led;

	DEBUG_TRACE("Reed switch...");
	static NrfSwitch nrf_reed_switch(BSP::GPIO::GPIO_REED_SW, REED_SWITCH_DEBOUNCE_TIME_MS, REED_SWITCH_ACTIVE_STATE);

#ifdef BUZZER_EN_PIN
	DEBUG_TRACE("Buzzer...");
	static Buzzer buzzer(BUZZER_EN_PIN);
	buzzer_ctl = &buzzer;
#else
	buzzer_ctl = nullptr;
#endif

	DEBUG_TRACE("BLE...");
	BleInterface::get_instance().init();

	DEBUG_TRACE("IS25 flash...");
	static Is25Flash is25_flash;
	if (!is25_flash.init()) {
		DEBUG_ERROR("IS25 flash init failed — powering down for a clean retry");
		// Do NOT spin here feeding the watchdog: on a sealed EXTERNAL_WAKEUP
		// board a WDT-fed loop never resets and never pulses MCU_DONE, draining
		// the battery to death with no recovery. Give a brief, bounded RED
		// diagnostic flash (no watchdog kick), then powerdown(): on RSPB the
		// TPL5111 cold-cycles and retries next wake (best chance to clear a
		// transient QSPI/NOR glitch); on LinkIt this enters pseudo power-off.
		// powerdown() runs before configuration_store exists, so its
		// LAST_KNOWN_RTC save is safely skipped (guarded on configuration_store).
		for (int i = 0; i < 6; i++) {
			NrfRGBLed::set_color_raw(BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::RED);
			nrf_delay_ms(100);
			NrfRGBLed::set_color_raw(BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::BLACK);
			nrf_delay_ms(100);
		}
		PMU::powerdown();
	}

	return {nrf_reed_switch, is25_flash};
}


/**
 * @brief Phase 2 — Power-on reed switch gesture check.
 *
 * On power-on reset, the user must hold a magnet on the reed switch for 3 seconds
 * to confirm intentional boot.  Without this gesture the device powers down
 * immediately, preventing accidental wake from battery insertion or transient
 * power glitches.
 *
 * Two code paths depending on board type:
 *  - PSEUDO_POWER_OFF (LinkIt V4): timer-based, handles both real and pseudo power-on.
 *  - Non-PSEUDO (RSPB): simple polling countdown for true power-on reset only.
 *
 * @param nrf_reed_switch  Hardware reed switch instance for state/callback registration.
 */
static void init_power_on_check(NrfSwitch& nrf_reed_switch)
{
	DEBUG_TRACE("PMU Reset Cause = %s", PMU::reset_cause_str());

#ifdef POWER_ON_RESET_REQUIRES_REED_SWITCH
#ifdef PSEUDO_POWER_OFF
	// PSEUDO_POWER_OFF (LinkIt V4): The nRF52 has no true power switch — it uses
	// VSYS_SEL to latch its own supply via a load switch. "Power off" is a soft
	// shutdown (System OFF mode) with VSYS_SEL de-asserted. A reed switch GPIO
	// event wakes the chip, which sees "Pseudo Power On Reset" instead of a real
	// "Power On Reset". This branch handles both reset causes.
	{
		SensorsPowerGuard power_guard;
		NrfI2C::init();
		PMU::hardware_version(); // Side-effect: I2C probes for hardware detection
#if ENABLE_SEA_TEMP_SENSOR
		{
			try {
				EZO_RTD_Sensor rtd; // Puts the device into standby mode
			} catch (...) {}
		}
#endif
		NrfI2C::uninit();
	}
	bool is_linkit_v4 = (strncmp(PMU::hardware_version(), "linkit-v4", 9) == 0);

