arribada/linkit-v4-core/ports/nrf52840/main.cpp
	ResetCause cause = PMU::reset_cause();
	if ((is_linkit_v4 && cause == ResetCause::PSEUDO_POWER_ON) ||
		(!is_linkit_v4 && (cause == ResetCause::POWER_ON ||
				cause == ResetCause::PSEUDO_POWER_ON))) {

		volatile bool power_on_ready = false;
		system_timer->start();
		Timer::TimerHandle timer_handle;

		if (nrf_reed_switch.get_state()) {
			status_led->set(RGBLedColor::WHITE);
			BUZZER_ON(buzzer_ctl);
			timer_handle = system_timer->add_schedule([&power_on_ready]() {
				DEBUG_TRACE("Reed switch 3s period elapsed");
				power_on_ready = true;
			}, system_timer->get_counter() + 3000);
		} else {
			status_led->off();
			BUZZER_OFF(buzzer_ctl);
		}

		nrf_reed_switch.start([&timer_handle, &power_on_ready](bool state) {
			system_timer->cancel_schedule(timer_handle);
			if (state) {
				DEBUG_TRACE("Reed State: %u", state);
				GPIOPins::set(VSYS_SEL);
				status_led->set(RGBLedColor::WHITE);
				BUZZER_ON(buzzer_ctl);
				timer_handle = system_timer->add_schedule([&power_on_ready]() {
					DEBUG_TRACE("Reed switch 3s period elapsed");
					power_on_ready = true;
				}, system_timer->get_counter() + 3000);
			} else {
				status_led->off();
				GPIOPins::clear(VSYS_SEL);
				BUZZER_OFF(buzzer_ctl);
			}
		});

		GPIOPins::clear(VSYS_SEL);
		while (!power_on_ready) {
			PMU::kick_watchdog();
			PMU::run();
		}

		GPIOPins::set(VSYS_SEL);
		PMU::kick_watchdog();
		nrf_reed_switch.stop();
		BUZZER_BEEP_COUNT(buzzer_ctl,200,200,2);
	}
#else
	// Without PSEUDO_POWER_OFF (RSPB/gentracker): The board has a real power path
	// (TPL5111 or physical switch), so only true "Power On Reset" is checked with
	// a simple 3-second polling countdown — no timer/callback needed.
	if (PMU::reset_cause() == ResetCause::POWER_ON) {
		unsigned int countdown = 3000;
		DEBUG_TRACE("Enter Power On Reed Switch Check");
		while (countdown) {
			if (GPIOPins::value(BSP::GPIO_REED_SW) != REED_SWITCH_ACTIVE_STATE)
				break;
			PMU::delay_ms(1);
			countdown--;
		}

		if (countdown) {
			DEBUG_TRACE("Reed Switch Inactive -- Powering Down...");
			PMU::powerdown();
		}
		DEBUG_TRACE("Exiting Power On Reed Switch Check");
	}
#endif // PSEUDO_POWER_OFF
#endif // POWER_ON_RESET_REQUIRES_REED_SWITCH
}


/**
 * @brief Phase 3 — Storage and configuration.
 *
 * Sets up: scheduler, I2C bus, reed gesture wrapper, LittleFS filesystem
 * (mount or format+mount), configuration store, RTC restoration from flash,
 * and TPL5111 boot counter / modulo check (EXTERNAL_WAKEUP boards).
 *
 * @param nrf_reed_switch  Reed switch for boot-counter magnet override check.
 * @param is25_flash       External flash device for LFS backing store.
 * @return Reference to the mounted LFSFileSystem (static, lives in .bss).
 */
static LFSFileSystem& init_storage(NrfSwitch& nrf_reed_switch, Is25Flash& is25_flash)
{
	DEBUG_TRACE("Scheduler...");
	static Scheduler scheduler(system_timer);
	system_scheduler = &scheduler;

	// VSENSORS must be on during I2C init to prevent bus appearing stuck
	{
		SensorsPowerGuard power_guard;
		NrfI2C::init();
	}

	DEBUG_TRACE("Reed gesture...");
	static ReedSwitch reed_gesture_switch(nrf_reed_switch);
	reed_switch = &reed_gesture_switch;

	DEBUG_TRACE("LFS filesystem...");
	static LFSFileSystem lfs_file_system(&is25_flash, IS25_BLOCK_COUNT - OTA_UPDATE_RESERVED_BLOCKS);
	main_filesystem = &lfs_file_system;

	DEBUG_TRACE("Mount LFS filesystem...");
#ifdef FORCE_FORMAT_FILESYSTEM
	DEBUG_WARN("FORCE_FORMAT_FILESYSTEM enabled - formatting filesystem!");
	if (main_filesystem->format() < 0 || main_filesystem->mount() < 0)
	{
		DEBUG_ERROR("Failed to format LFS filesystem");
		PMU::powerdown();
	}
#else
	if (main_filesystem->mount() < 0)
	{
		DEBUG_TRACE("Format LFS filesystem...");
		if (main_filesystem->format() < 0 || main_filesystem->mount() < 0)
		{
			DEBUG_ERROR("Failed to format LFS filesystem");
			PMU::powerdown();
		}
	}
#endif

	DEBUG_TRACE("Configuration store...");
	static LFSConfigurationStore store(lfs_file_system);
	configuration_store = &store;
	configuration_store->init();

	// Restore last known RTC from flash (enables MGA-ANO assistance and faster GNSS TTFF)
	{
		unsigned int last_rtc = configuration_store->read_param<unsigned int>(ParamID::LAST_KNOWN_RTC);

		// Anti-corruption guard (2026-05, audit mitigation C): a POF / brown-out
		// mid-LFS-write or a single-byte bit flip in the param block can leave
		// LAST_KNOWN_RTC at an impossible future value. Restoring such a value
		// would put the RTC decades ahead and break every time-based defense
		// (cooldown, hauled, rate limiter, ANO staleness).
		//
		// We deliberately do NOT reject "small" values (< 2000-01-01) because:
		//   - On RSPB / EXTERNAL_WAKEUP, the pseudo-RTC chain legitimately
		//     stores small values (sum of WAKEUP_PERIOD * boot_count) before
		//     the first GNSS sync.
		//   - On sealed LinkIt V4 without GNSS, M1a periodic save persists the
		//     virtual RTC (uptime-based, also small). Rejecting these would
		//     defeat the entire post-WDT continuity mechanism.
		// Field-deployed corruption tends to flip bits in the high half of the
		// value, producing far-future values. The upper bound catches those.
		// Tighter defense is the LFS file-level integrity (LittleFS CRC).
		// Near-term horizon (2035, not 2100): tight enough to reject a bit30/bit31
		// flip in a ~2026 value, which lands in 2059 / 2093 — both were < the old
		// 2100 bound and thus slipped through.
		constexpr unsigned int RTC_MAX_VALID = 2051222400U; // 2035-01-01
		if (last_rtc > RTC_MAX_VALID) {
			DEBUG_WARN("Suspicious LAST_KNOWN_RTC=%u (post-2035), treating as corrupt", last_rtc);
			last_rtc = 0;  // force virtual RTC fallback
		}
#ifdef EXTERNAL_WAKEUP
		// Pseudo RTC: advance the last known RTC by WAKEUP_PERIOD on a genuine
		// power-on wake. L1 (2026-07): only a POWER_ON reset (TPL5111 timer /
		// reed) represents a real elapsed WAKEUP_PERIOD. A soft/WDT reset reboot
		// does NOT, so advancing on those would race the pseudo-RTC ahead of real
		// time (a reset storm could jump it hours) until the next GNSS sync
		// corrects it. On those, restore the last known RTC without advancing.
		unsigned int wakeup_period = configuration_store->read_param<unsigned int>(ParamID::WAKEUP_PERIOD);
		bool genuine_timer_wake = (PMU::reset_cause() == ResetCause::POWER_ON);
		if (last_rtc > 0 && wakeup_period > 0 && genuine_timer_wake) {
			unsigned int pseudo_rtc = last_rtc + wakeup_period;
			// Clamp the advanced value to the same 2035 horizon and catch a uint
			// wrap: a corrupt WAKEUP_PERIOD (or a near-horizon last_rtc) must not
			// push the RTC decades ahead and then get persisted below.
			if (pseudo_rtc < last_rtc || pseudo_rtc > RTC_MAX_VALID) {
				DEBUG_WARN("EXTERNAL_WAKEUP: pseudo_rtc=%u out of range — restoring last_rtc without advance", pseudo_rtc);
				rtc->settime(static_cast<std::time_t>(last_rtc));
			} else {
				configuration_store->write_param(ParamID::LAST_KNOWN_RTC, pseudo_rtc);
				rtc->settime(static_cast<std::time_t>(pseudo_rtc));
				DEBUG_INFO("EXTERNAL_WAKEUP: Pseudo RTC set to %u (last=%u + period=%u)", pseudo_rtc, last_rtc, wakeup_period);
			}
		} else if (last_rtc > 0) {
			rtc->settime(static_cast<std::time_t>(last_rtc));
			DEBUG_INFO("EXTERNAL_WAKEUP: Restored LAST_KNOWN_RTC=%u without advance (reset_cause=%d)",
				last_rtc, (int)PMU::reset_cause());
		} else {
			DEBUG_INFO("EXTERNAL_WAKEUP: No pseudo RTC available (last_rtc=%u, wakeup_period=%u)", last_rtc, wakeup_period);
		}

		// TPL5111 boot counter management
		unsigned int boot_counter = configuration_store->boot_count_increment();
		DEBUG_INFO("EXTERNAL_WAKEUP: Boot counter = %u", boot_counter);

		// Check if this is not our turn to run based on modulo
		if (boot_counter > 0 && !configuration_store->boot_count_check_modulo(boot_counter)) {
			if (nrf_reed_switch.get_state()) {
				DEBUG_INFO("EXTERNAL_WAKEUP: Magnet detected | skipping modulo powerdown");
			} else {
				DEBUG_INFO("EXTERNAL_WAKEUP: Not our turn to run (modulo check) | powering down");
				status_led->flash(RGBLedColor::YELLOW, 100);
				PMU::delay_ms(300);
				status_led->off();
				PMU::powerdown();
			}
		}
		DEBUG_INFO("EXTERNAL_WAKEUP: Our turn to run | continuing boot");
#else
		// Non-TPL5111 boards: restore last known RTC directly
		if (last_rtc > 0) {
			rtc->settime(static_cast<std::time_t>(last_rtc));
			DEBUG_INFO("Restored LAST_KNOWN_RTC = %u", last_rtc);
		}
#endif

