arribada/linkit-v4-core/ports/nrf52840/main.cpp
		// Virtual RTC fallback (2026-05): sealed turtle deployments may go
		// days / weeks before a first GNSS fix, and LAST_KNOWN_RTC stays at 0
		// until then. Without an `is_set()` RTC, every time-based defense
		// (cooldown, hauled, rate limiter, sequencer) is silently dead —
		// they all gate on `rtc->is_set()`. Initialize to 1 (epoch + 1 s) so
		// relative-time math works from boot; GPSService::on_fix() will
		// overwrite with real UTC the moment a fix arrives. Code paths that
		// need absolute UTC (PASS_PREDICTION, log human-readable timestamps)
		// already independently validate the time horizon — they'll see a
		// "1970" RTC and behave defensively until sync.
		if (rtc && !rtc->is_set()) {
			rtc->settime(static_cast<std::time_t>(1));
			DEBUG_INFO("Cold-first-boot: RTC initialized to virtual epoch (1) — sync on first GNSS");
		}
	}

	return lfs_file_system;
}


/**
 * @brief Phase 4 — Battery monitor initialisation.
 *
 * Selects the appropriate battery monitor implementation based on CMake flags:
 *  - BATTERY_MONITOR_ANALOG: nRF SAADC-based (LinkIt V4)
 *  - BATTERY_MONITOR_STC3117: I2C fuel gauge (RSPB)
 *  - BATTERY_MONITOR_FAKE: fixed 4.1 V stub (testing)
 */
static void init_battery()
{
	DEBUG_TRACE("Battery monitor...");
	uint8_t critical_batt_level = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LB_CRITICAL_THRESH));
	uint8_t low_batt_level = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LB_THRESHOLD));

#if defined(BATTERY_MONITOR_ANALOG)
#ifdef BATTERY_ADC
	// Chemistry selected at compile time via -DBATTERY_CHEMISTRY=<enum_name>
	// (CMake option BATTERY_CHEMISTRY). Defaults to NCR18650 Li-ion.
#ifndef BATTERY_CHEMISTRY
#define BATTERY_CHEMISTRY BATT_CHEM_NCR18650_3100_3400
#endif
	static NrfBatteryMonitor nrf_battery_monitor(BATTERY_ADC, BATTERY_CHEMISTRY,
			critical_batt_level, low_batt_level);
	battery_monitor = &nrf_battery_monitor;
#else
	static BatteryMonitor stub_battery_monitor(low_batt_level, critical_batt_level);
	battery_monitor = &stub_battery_monitor;
#endif
#elif defined(BATTERY_MONITOR_FAKE)
	DEBUG_INFO("Using FAKE battery monitor (always 4.1V)");
	static FakeBatteryMonitor fake_battery_monitor(critical_batt_level, low_batt_level);
	battery_monitor = &fake_battery_monitor;
#elif defined(BATTERY_MONITOR_STC3117)
	DEBUG_INFO("Using STC3117 fuel gauge battery monitor");
	static GaugeBatteryMonitor stc3117_battery_monitor(critical_batt_level, low_batt_level);
	battery_monitor = &stc3117_battery_monitor;
#else
	#error "No battery monitor type defined! Set BATTERY_MONITOR_TYPE in CMake"
#endif
}


/**
 * @brief Phase 5 — Core services (system log, DTE handler, OTA updater, memory access).
 *
 * @param lfs_file_system  Mounted filesystem for system.log and OTA staging.
 * @param is25_flash       Raw flash device for OTA block-level writes.
 */
static void init_core_services(LFSFileSystem& lfs_file_system, Is25Flash& is25_flash)
{
	DEBUG_INFO("Creating log files...");
	static SysLogFormatter sys_log_formatter;
	static FsLog fs_system_log(&lfs_file_system, "system.log", 1024*1024);
	fs_system_log.set_log_formatter(&sys_log_formatter);
#ifdef EXTERNAL_WAKEUP
	// RSPB does a REAL power cut every wake and DEBUG_TO_SYSTEMLOG would otherwise
	// write 128 bytes + a set_attr metadata commit (two LittleFS ops) to flash for
	// EVERY routine INFO line â heavy flash wear + battery cost over many wakes/day
	// for a year. Persist only WARN/ERROR; the console (UART/USB) path still emits
	// full DEBUG for field debugging without touching flash.
	fs_system_log.set_log_level(LOG_LEVEL_WARN);
#endif
	DebugLogger::system_log = &fs_system_log;

	DEBUG_TRACE("RAM access...");
	static NrfMemoryAccess nrf_memory_access;
	memory_access = &nrf_memory_access;

	DEBUG_TRACE("DTE handler...");
	static DTEHandler dte_handler_local;
	dte_handler = &dte_handler_local;

	DEBUG_TRACE("OTA updater...");
	ble_service = &BleInterface::get_instance();
	static OTAFlashFileUpdater ota_flash_file_updater(&lfs_file_system, &is25_flash, IS25_BLOCK_COUNT - OTA_UPDATE_RESERVED_BLOCKS, OTA_UPDATE_RESERVED_BLOCKS);
	ota_updater = &ota_flash_file_updater;
}


/**
 * @brief Phase 6 — Communication backends and GPS.
 *
 * Initialises the salt-water switch (SWS) service, the satellite/LoRa TX backend
 * (mutually exclusive: SMD, KIM2, or LoRa RAK3172), and the GNSS receiver (M10Q).
 * Each backend's log file is created here alongside the device.
 *
 * @param lfs_file_system  Mounted filesystem for sensor.log and SWS log.
 */
static void init_communication(LFSFileSystem& lfs_file_system)
{
#if ENABLE_SWS_ANALOG
	DEBUG_INFO(">> Creating services...");
	static SWSAnalogService sws_analog;

#if ENABLE_SWS_LOG
	DEBUG_TRACE("SWS Log...");
	static SWSLogFormatter sws_log_formatter;
	static FsLog sws_log(&lfs_file_system, "SWS", 1024*1024);
	sws_log.set_log_formatter(&sws_log_formatter);
	SWSAnalogService::set_sws_logger(&sws_log);
#endif
#endif

#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
	DEBUG_TRACE("LoRa RAK3172...");
	try {
		static LoRaDevice lora_rak3172;
		lora_device_instance = &lora_rak3172;
		static LoRaTxService lora_tx_service(lora_rak3172);
	} catch (...) {
		DEBUG_INFO("LoRa RAK3172 not detected");
		lora_device_instance = nullptr;
	}
#elif defined(ARGOS_SMD) && (ARGOS_SMD == 1)
	DEBUG_TRACE("SMD Satellite...");
	try {
#if defined(SMD_UART) && (SMD_UART == 1)
		static SmdSatCmdAt smd_cmd;
#else
		static SmdSatCmdSpi smd_cmd;
#endif
		static SmdSat argos_smd(smd_cmd);
		smd_sat_instance = &argos_smd;  // Store pointer for SMD DFU OTA
		kineis_device_instance = &argos_smd;
		static ArgosTxService argos_tx_service(argos_smd);
	} catch (...) {
		DEBUG_INFO("SMD not detected");
		smd_sat_instance = nullptr;
		kineis_device_instance = nullptr;
	}
#else
	DEBUG_TRACE("KIM2...");
	try {
		static KIM2Device kim2;
		kineis_device_instance = &kim2;
		kim2_device_instance = &kim2;
		static ArgosTxService argos_tx_service(kim2);
	} catch (...) {
		DEBUG_INFO("KIM2 not detected");
		kineis_device_instance = nullptr;
		kim2_device_instance = nullptr;
	}
#endif

