arribada/linkit-v4-core/ports/nrf52840/main.cpp
	DEBUG_TRACE("GPS M10Q ...");
	static GPSLogFormatter fs_sensor_log_formatter;
	static FsLog fs_sensor_log(&lfs_file_system, "sensor.log", 1024*1024);
	fs_sensor_log.set_log_formatter(&fs_sensor_log_formatter);

	try {
		static M10QAsyncReceiver m10q_gnss;
		gps_device = &m10q_gnss;
		static GPSService gps_service_instance(m10q_gnss, &fs_sensor_log);
		gps_service = &gps_service_instance;
	} catch (...) {
		DEBUG_INFO("GPS M10Q not detected");
	}
}


/**
 * @brief Phase 7 — Sensor detection, log creation, and service registration.
 *
 * Auto-detects I2C sensors (pressure, CDT, ALS, pH, sea temperature, accelerometer,
 * thermistor, camera) and creates their log files and SensorService instances.
 * Pressure sensor detection uses placement new into static aligned storage to avoid
 * heap allocation.  Each sensor that fails detection logs an INFO and is skipped.
 *
 * @param lfs_file_system  Mounted filesystem for per-sensor log files.
 */
static void init_sensors(LFSFileSystem& lfs_file_system)
{
#if ENABLE_PRESSURE_SENSOR || ENABLE_CDT_SENSOR
	DEBUG_TRACE("Pressure Sensor...");
	PressureSensorDevice *pressure_sensor_devices[BSP::I2C_TOTAL_NUMBER] = {nullptr};
#ifndef DUMMY_PRESSURE_SENSOR
	// Static storage for pressure sensors — one per I2C bus, no heap allocation
	static constexpr size_t PressureStorageSize = std::max({sizeof(LPS28DFW), sizeof(Bar100), sizeof(MS58xxLL)});
	static constexpr size_t PressureStorageAlign = std::max({alignof(LPS28DFW), alignof(Bar100), alignof(MS58xxLL)});
	struct alignas(PressureStorageAlign) PressureStorage { std::byte data[PressureStorageSize]; };
	static PressureStorage pressure_storage[BSP::I2C_TOTAL_NUMBER];

	// Sensor detection order — LPS28DFW is default for RSPB board
#if defined(BOARD_RSPB)
	static constexpr unsigned int i2caddr[4] = { LPS28DFW_ADDRESS, MS5803_ADDRESS, MS5837_ADDRESS, BAR100_ADDRESS };
	static const char* const variant[4] = { "LPS28DFW", MS5803_VARIANT, MS5837_VARIANT, "BAR100-R3-RP" };
#else
#ifndef LPS28DFW_ADDRESS
#define LPS28DFW_ADDRESS 0x5C
#endif
	static constexpr unsigned int i2caddr[4] = { MS5803_ADDRESS, MS5837_ADDRESS, BAR100_ADDRESS, LPS28DFW_ADDRESS };
	static const char* const variant[4] = { MS5803_VARIANT, MS5837_VARIANT, "BAR100-R3-RP", "LPS28DFW" };
#endif

	for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
		for (unsigned int j = 0; j < 4; j++) {
			try {
				PressureSensorDevice *device;
#if defined(BOARD_RSPB)
				if (j == 0) {
					device = new (&pressure_storage[i]) LPS28DFW(i, i2caddr[j]);
				} else if (j == 3) {
					device = new (&pressure_storage[i]) Bar100(i, i2caddr[j]);
				} else {
					device = new (&pressure_storage[i]) MS58xxLL(i, i2caddr[j], variant[j]);
				}
#else
				if (j == 2) {
					device = new (&pressure_storage[i]) Bar100(i, i2caddr[j]);
				} else if (j == 3) {
					device = new (&pressure_storage[i]) LPS28DFW(i, i2caddr[j]);
				} else {
					device = new (&pressure_storage[i]) MS58xxLL(i, i2caddr[j], variant[j]);
				}
#endif
				pressure_sensor_devices[i] = device;
				DEBUG_TRACE("%s: found on i2cbus=%u i2caddr=0x%02x", variant[j], i, i2caddr[j]);
				break;
			} catch (...) {
				DEBUG_INFO("Nothing detected on i2cbus=%u i2caddr=0x%02x", i, i2caddr[j]);
				pressure_sensor_devices[i] = nullptr;
			}
		}
	}
#else
	static PressureSensorDummyDevice dummy_pressure;
	pressure_sensor_devices[0] = &dummy_pressure;
#endif

#if ENABLE_CDT_SENSOR
	DEBUG_TRACE("AD5933...");
	AD5933 *ad5933_devices[BSP::I2C_TOTAL_NUMBER];
	struct alignas(AD5933LL) AD5933Storage { std::byte data[sizeof(AD5933LL)]; };
	static AD5933Storage ad5933_storage[BSP::I2C_TOTAL_NUMBER];
	for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
		try {
			ad5933_devices[i] = new (&ad5933_storage[i]) AD5933LL(i, AD5933_ADDRESS);
			DEBUG_TRACE("AD5933: found on i2cbus=%u i2caddr=0x%02x", i, AD5933_ADDRESS);
		} catch (...) {
			DEBUG_INFO("AD5933: not detected on i2cbus=%u i2caddr=0x%02x", i, AD5933_ADDRESS);
			ad5933_devices[i] = nullptr;
		}
	}

	static CDTLogFormatter cdt_sensor_log_formatter;
	static FsLog cdt_sensor_log(&lfs_file_system, "CDT", 1024*1024);
	cdt_sensor_log.set_log_formatter(&cdt_sensor_log_formatter);
#endif

#if ENABLE_PRESSURE_SENSOR
	static PressureLogFormatter pressure_sensor_log_formatter;
	static FsLog pressure_sensor_log(&lfs_file_system, "PRESSURE", 1024*1024);
	pressure_sensor_log.set_log_formatter(&pressure_sensor_log_formatter);
#endif

	bool cdt_present = false;
	bool standalone_pressure = false;
	// Iterate twice to allow flags to be set
	for (unsigned int x = 0; x < 2; x++) {
		for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
#if ENABLE_CDT_SENSOR
			if (!cdt_present && ad5933_devices[i] && pressure_sensor_devices[i]) {
				DEBUG_TRACE("CDT on bus %u...", i);
				cdt_present = true;
				static CDT cdt(*pressure_sensor_devices[i], *ad5933_devices[i]);
				static CDTSensorService cdt_sensor_service(cdt, &cdt_sensor_log);
			} else
#endif
#if ENABLE_PRESSURE_SENSOR
			if (!standalone_pressure && pressure_sensor_devices[i]) {
				DEBUG_TRACE("Standalone Pressure Sensor on bus %u...", i);
				standalone_pressure = true;
				static PressureSensor pressure_sensor(*pressure_sensor_devices[i]);
				static PressureSensorService pressure_sensor_service(pressure_sensor, &pressure_sensor_log);
			}
#endif
			(void)i; // Suppress unused warning when both disabled
		}

		if (standalone_pressure && cdt_present)
			break;
	}
#endif // ENABLE_PRESSURE_SENSOR || ENABLE_CDT_SENSOR

#if ENABLE_ALS_SENSOR
	DEBUG_TRACE("LTR303...");
	static ALSLogFormatter als_sensor_log_formatter;
	static FsLog als_sensor_log(&lfs_file_system, "ALS", 1024*1024);
	als_sensor_log.set_log_formatter(&als_sensor_log_formatter);
	try {
		static LTR303 ltr303;
		static ALSSensorService als_sensor_service(ltr303, &als_sensor_log);
	} catch (...) {
		DEBUG_INFO("LTR303: not detected");
	}
#endif

#if ENABLE_PH_SENSOR
	DEBUG_TRACE("OEM PH...");
	static PHLogFormatter ph_sensor_log_formatter;
	static FsLog ph_sensor_log(&lfs_file_system, "PH", 1024*1024);
	ph_sensor_log.set_log_formatter(&ph_sensor_log_formatter);
	try {
		static OEM_PH_Sensor ph;
		static PHSensorService ph_sensor_service(ph, &ph_sensor_log);
	} catch (...) {
		DEBUG_INFO("OEM PH: not detected");
	}
#endif

