arribada/linkit-v4-core/ports/nrf52840/main.cpp
#if ENABLE_SEA_TEMP_SENSOR
	static SeaTempLogFormatter rtd_sensor_log_formatter;
	static FsLog rtd_sensor_log(&lfs_file_system, "RTD", 1024*1024);
	rtd_sensor_log.set_log_formatter(&rtd_sensor_log_formatter);

	DEBUG_TRACE("EZO RTD...");
	try {
		static EZO_RTD_Sensor rtd;
		static SeaTempSensorService rtd_sensor_service(rtd, &rtd_sensor_log);
	} catch (ErrorCode e) {
		DEBUG_INFO("EZO RTD: not detected [%04X]", e);
	}

	static SeaTempLogFormatter tsys01_sensor_log_formatter;
	static FsLog tsys01_sensor_log(&lfs_file_system, "TSYS01", 1024*1024);
	tsys01_sensor_log.set_log_formatter(&tsys01_sensor_log_formatter);

	DEBUG_TRACE("TSYS01...");
	try {
		static TSYS01 tsys01;
		static SeaTempSensorService tsys01_sensor_service(tsys01, &tsys01_sensor_log);
	} catch (ErrorCode e) {
		DEBUG_INFO("TSYS01: not detected [%04X]", e);
	}
#endif

#if ENABLE_AXL_SENSOR
	DEBUG_TRACE("BMA400...");
	static AXLLogFormatter axl_sensor_log_formatter;
	static FsLog axl_sensor_log(&lfs_file_system, "AXL", 1024*1024);
	axl_sensor_log.set_log_formatter(&axl_sensor_log_formatter);
	try {
		static BMA400 bma400;
		static AXLSensorService axl_sensor_service(bma400, &axl_sensor_log);
	} catch (...) {
		DEBUG_INFO("BMA400: not detected");
	}
#endif

#if ENABLE_THERMISTOR_SENSOR
	DEBUG_TRACE("Thermistor NTC...");
	static ThermistorLogFormatter thermistor_sensor_log_formatter;
	static FsLog thermistor_sensor_log(&lfs_file_system, "THERMISTOR", 1024*1024);
	thermistor_sensor_log.set_log_formatter(&thermistor_sensor_log_formatter);
	try {
		static Thermistor thermistor(THERMISTOR_ADC);
		static ThermistorSensorService thermistor_sensor_service(thermistor, &thermistor_sensor_log);
	} catch (...) {
		DEBUG_INFO("Thermistor: not detected");
	}
#endif

#ifdef CAM_PWR_EN
	DEBUG_TRACE("RunCam...");
	static CAMLogFormatter cam_sensor_log_formatter;
	static FsLog cam_sensor_log(&lfs_file_system, "CAM", 1024*1024);
	cam_sensor_log.set_log_formatter(&cam_sensor_log_formatter);
	try {
		static RunCam run_cam;
		static CAMService cam_service(run_cam, &cam_sensor_log);
	} catch (...) {
		DEBUG_INFO("RunCam: not detected");
	}
#endif

#if ENABLE_MORTALITY_SENSOR
	DEBUG_TRACE("Mortality detection...");
	static MortalityLogFormatter mortality_log_formatter;
	static FsLog mortality_log(&lfs_file_system, "MORTALITY", 64*1024);
	mortality_log.set_log_formatter(&mortality_log_formatter);
	static MortalityService mortality_svc(&mortality_log);
	mortality_service = &mortality_svc;
#endif

	(void)lfs_file_system; // Suppress unused warning when no sensors enabled
}


/**
 * @brief Phase 8 — Runtime services (memory monitor, dive mode, shutdown timer).
 *
 * Starts background services that run during the operational lifetime:
 *  - MemoryMonitorService: periodic heap/stack usage reporting.
 *  - DiveModeService: reed-switch-triggered dive/surface mode toggle.
 *  - EXTERNAL_WAKEUP shutdown timer: powers down after configured seconds (TPL5111 boards).
 *
 * @param nrf_reed_switch  Hardware reed switch for DiveModeService.
 */
static void init_runtime(NrfSwitch& nrf_reed_switch)
{
	DEBUG_TRACE("Memory monitor...");
	static MemoryMonitorService memory_monitor_service;

	DEBUG_TRACE("Dive mode monitor...");
	static DiveModeService dive_mode_service(nrf_reed_switch);

	// R4 robustness (2026-05 deep-idle refactor): if the boot was a WDT reset,
	// inhibit the deep-idle fast-path for the first GPS session post-boot.
	// Force cold-cycle to prove the cold path works before re-engaging the
	// optimization. Cleared in GPSService::react(GPSEventPVT) on first fix.
	if (gps_service && PMU::reset_cause() == ResetCause::WDT_RESET) {
		DEBUG_INFO("R4: WDT reset detected — inhibiting deep-idle for first GPS session");
		gps_service->set_deep_idle_inhibit_first_session(true);
	}

#ifdef EXTERNAL_WAKEUP
	// TPL5111 shutdown timer — powerdown after SHUTDOWN_TIMER seconds
	{
		unsigned int shutdown_timer = configuration_store->read_param<unsigned int>(ParamID::SHUTDOWN_TIMER);
		// H2 (2026-07): ALWAYS schedule an awake-time backstop. If SHUTDOWN_TIMER
		// is 0 (its firmware default, and the value a field factory_reset would
		// restore) and SHUTDOWN_NTIME_SAT is also 0, nothing else ends the wake:
		// the device idles in OperationalState at active current until the
		// battery goes critical, because on RSPB the 15-min WDT reset does NOT
		// cut power. So fall back to a generous hard cap — well above any
		// legitimate session (cold GNSS acq + TX, even with RX) but far below the
		// TPL5111 wake period (~1h45) — instead of scheduling no powerdown at all.
		constexpr unsigned int SHUTDOWN_HARD_CAP_S = 1800;  // 30 min absolute ceiling
		unsigned int effective_shutdown = (shutdown_timer > 0) ? shutdown_timer : SHUTDOWN_HARD_CAP_S;
		DEBUG_INFO("EXTERNAL_WAKEUP: Awake cap scheduled for %u s (SHUTDOWN_TIMER=%u)",
			effective_shutdown, shutdown_timer);
		system_scheduler->post_task_prio([]() {
			DEBUG_INFO("EXTERNAL_WAKEUP: Awake cap reached | powering down");
			PMU::powerdown();
		}, "SHUTDOWN_TIMER", Scheduler::DEFAULT_PRIORITY, effective_shutdown * 1000);
	}
#endif
}


/**
 * @brief Application entry point.
 *
 * Runs the eight init phases in order, starts the GenTracker FSM, then enters
 * the infinite scheduler loop with deep-idle power management.
 *
 * @note This function never returns.  All init-phase objects are static and
 *       live in .bss — the main() stack frame only holds the loop locals.
 */
int main()
{
	// R1 robustness (2026-05 deep-idle refactor): force the GPS rail LOW
	// before ANYTHING else runs. With deep-idle enabled, the rail can be left
	// ON across hard faults / WDT resets — this 1-instruction invariant cuts
	// it on every boot before init_peripherals even runs. Same for GPS_RST
	// (drive low to assert reset) and GPS_EXT_INT (high-Z so we don't push
	// edges into a still-coming-up M10Q). Uses raw nrf_gpio API since BSP::
	// hasn't been initialized yet at this point.
	{
		auto& pwr_en   = BSP::GPIO_Inits[BSP::GPIO::GPIO_GPS_PWR_EN];
		auto& gps_rst  = BSP::GPIO_Inits[BSP::GPIO::GPIO_GPS_RST];
		auto& ext_int  = BSP::GPIO_Inits[BSP::GPIO::GPIO_GPS_EXT_INT];
		nrf_gpio_cfg_output(pwr_en.pin_number);
		nrf_gpio_pin_clear(pwr_en.pin_number);
		nrf_gpio_cfg_output(gps_rst.pin_number);
		nrf_gpio_pin_clear(gps_rst.pin_number);
		nrf_gpio_cfg_default(ext_int.pin_number);  // high-Z input
	}

