arribada/linkit-v4-core/ports/nrf52840/main.cpp
	// H1 (2026-07): the init phases below run BEFORE the FSM's boot-fail check.
	// Without this barrier an exception (save_params -> CONFIG_STORE_CORRUPTED,
	// a throwing FS mount, etc.) escapes main() -> std::terminate -> abort() ->
	// a 15-min watchdog hang per cycle with no escalation — and on RSPB a WDT
	// reset does not cut power, so it drains the battery to death. Route init
	// faults through the shared sealed-device recovery ladder instead.
	try {
		auto [reed, flash] = init_peripherals();
		init_power_on_check(reed);

		auto& lfs = init_storage(reed, flash);
		init_battery();
		init_core_services(lfs, flash);
		init_communication(lfs);
		init_sensors(lfs);
		init_runtime(reed);
	} catch (...) {
		DEBUG_ERROR("main: unhandled exception during init phases — entering recovery");
		GenTracker::recover_from_init_failure();  // does not return
	}

	DEBUG_TRACE("Entering main SM...");
	try {
		GenTracker::start();
	} catch (...) {
		// A synchronous throw from FSM start (e.g. BootState::entry). BootState
		// already bumped the boot-fail counter, so a bounded reset lets that
		// machinery escalate on the next boot rather than hanging here.
		DEBUG_ERROR("main: unhandled exception from FSM start — resetting");
		PMU::kick_watchdog();
		PMU::delay_ms(100);
		PMU::reset(false);
	}

	// Power rail management: cut peripheral power rails when no task is due soon.
	// Threshold tuned from the original 5000 ms → 250 ms. The lower the threshold,
	// the more aggressively VSYS toggles 3.3V↔1.8V around short scheduler idles.
	// Rationale per scenario:
	//   - SWS analog detector multi-sample (UW_SAMPLE_GAP = 1000 ms) : both 1000 ms
	//     and 250 ms thresholds let reduce_power_rails() fire between samples.
	//   - SWS underwater fast-sample (period ~500 ms) : 1000 ms threshold blocks
	//     bascule (500 < 1000) → VSYS stuck at 3.3V the whole dive. 250 ms lets
	//     the ~500 ms idle window between samples trigger the bascule.
	//   - Generic services scheduled every 300-900 ms : same story.
	// Cost: each bascule cycle adds ~2 ms PMU::delay_ms in restore_power_rails().
	// At a 500 ms cycle that's 0.4 % time overhead — negligible vs the ~8 µA saved
	// while at 1.8V. The TPS63901 SEL pin supports unlimited switching.
	static constexpr uint64_t IDLE_POWER_SAVE_THRESHOLD_MS = 250;
	static bool power_rails_reduced = false;

#ifndef VALIDATION_LOG_ENABLE
#define VALIDATION_LOG_ENABLE 0
#endif
// #if VALIDATION_LOG_ENABLE
// 	// Sleep-optim cumulative accounting. Reset on first VAL_SLEEP summary tick.
// 	// `reduced_ms` = time spent with VSYS at 1.8 V (peripherals dark).
// 	// `active_ms`  = time spent with VSYS at 3.3 V (running scheduler tasks).
// 	// Ratio reduced/(reduced+active) is the effective sleep-optim duty cycle:
// 	// > 0.9 in steady state on the bench (no surface activity).
// 	static uint64_t s_val_reduced_total_ms = 0;
// 	static uint64_t s_val_active_total_ms = 0;
// 	static uint64_t s_val_last_enter_reduce_ms = 0;
// 	static uint64_t s_val_last_exit_reduce_ms = 0;
// 	static uint64_t s_val_last_summary_ms = 0;
// 	static uint64_t s_val_summary_reduce_count = 0;
// 	static constexpr uint64_t VAL_SLEEP_SUMMARY_PERIOD_MS = 60000;  // 1 min
// #endif

	// The scheduler should run forever.  Any run-time exceptions should be handled and passed to FSM.
	while (true)
	{
		try {
#ifdef DEBUG_UART_TX_PIN
			if (g_debug_mode != BaseDebugMode::UART)
#endif
				NrfUSB::process();

			// Restore power rails BEFORE running scheduler tasks —
			// peripherals need 3.3V before any SPI/I2C/UART access.
			if (power_rails_reduced) {
				uint64_t remaining = system_scheduler->ms_until_next_task();
				if (remaining <= IDLE_POWER_SAVE_THRESHOLD_MS) {
					PMU::restore_power_rails();
					power_rails_reduced = false;
					DEBUG_TRACE("IDLE_POWER_SAVE: exit (%llu ms remaining)", remaining);
// #if VALIDATION_LOG_ENABLE
// 					uint64_t now_ms = PMU::get_timestamp_ms();
// 					uint64_t this_reduce_ms = (s_val_last_enter_reduce_ms > 0 &&
// 					                           now_ms > s_val_last_enter_reduce_ms)
// 					                          ? (now_ms - s_val_last_enter_reduce_ms) : 0;
// 					s_val_reduced_total_ms += this_reduce_ms;
// 					s_val_last_exit_reduce_ms = now_ms;
// 					DEBUG_INFO("[VAL-SLEEP] exit_reduce reduced_ms=%llu remaining_ms=%llu",
// 					           this_reduce_ms, remaining);
// #endif
				}
			}

			system_scheduler->run();

			// Reduce power rails when no tasks are due for a while
			uint64_t idle_ms = system_scheduler->ms_until_next_task();
			if (idle_ms > IDLE_POWER_SAVE_THRESHOLD_MS && !power_rails_reduced) {
				DEBUG_TRACE("IDLE_POWER_SAVE: enter (%llu ms idle)", idle_ms);
				power_rails_reduced = true;
				PMU::reduce_power_rails();
// #if VALIDATION_LOG_ENABLE
// 				uint64_t now_ms = PMU::get_timestamp_ms();
// 				uint64_t this_active_ms = (s_val_last_exit_reduce_ms > 0 &&
// 				                            now_ms > s_val_last_exit_reduce_ms)
// 				                          ? (now_ms - s_val_last_exit_reduce_ms) : 0;
// 				s_val_active_total_ms += this_active_ms;
// 				s_val_last_enter_reduce_ms = now_ms;
// 				s_val_summary_reduce_count++;
// 				DEBUG_INFO("[VAL-SLEEP] enter_reduce idle_ms=%llu active_ms=%llu",
// 				           idle_ms, this_active_ms);
// 				// Periodic cumulative summary — emits ratio + total counts.
// 				// Logs every minute regardless of activity, so a flat curve in
// 				// the log timeline reveals a stuck-awake regression.
// 				if (s_val_last_summary_ms == 0) s_val_last_summary_ms = now_ms;
// 				if (now_ms - s_val_last_summary_ms >= VAL_SLEEP_SUMMARY_PERIOD_MS) {
// 					uint64_t total = s_val_reduced_total_ms + s_val_active_total_ms;
// 					unsigned int duty_pct = total > 0
// 					                        ? (unsigned int)((s_val_reduced_total_ms * 100) / total)
// 					                        : 0;
// 					DEBUG_INFO("[VAL-SLEEP] summary reduced_ms=%llu active_ms=%llu duty=%u%% cycles=%llu",
// 					           s_val_reduced_total_ms, s_val_active_total_ms, duty_pct,
// 					           s_val_summary_reduce_count);
// 					s_val_last_summary_ms = now_ms;
// 				}
// #endif
			}

			// Safety watchdog kick — reduces dependency on scheduled task
			PMU::kick_watchdog();

			PMU::run();
		} catch (ErrorCode e) {
			ErrorEvent event;
			event.error_code = e;
			GenTracker::dispatch(event);
		} catch (const std::exception& ex) {
			// std::bad_alloc, std::bad_function_call, std::out_of_range, etc.
			// Without this catch, the exception would reach std::terminate ->
			// __verbose_terminate_handler -> abort() -> hang in fputc until
			// the 15-min watchdog reset cycle. Convert to ErrorEvent so the
			// FSM can react cleanly (and now, via the boot-fail counter,
			// trigger factory_reset retry if these become persistent).
			DEBUG_ERROR("main loop: unhandled std::exception: %s", ex.what());
			ErrorEvent event;
			event.error_code = ErrorCode::RESOURCE_NOT_AVAILABLE;
			GenTracker::dispatch(event);
		} catch (...) {
			// Last-resort catch for SoftDevice asserts, mid-throw exceptions,
			// or non-derived thrown types. Same rationale as above.
			DEBUG_ERROR("main loop: unhandled unknown exception");
			ErrorEvent event;
			event.error_code = ErrorCode::RESOURCE_NOT_AVAILABLE;
			GenTracker::dispatch(event);
		}
	}
}
